app/views/candidates/_form.html.erb

    <%= f.label :gender %><br>
    <%= f.select :gender, make_genders_drop_down %>
---
SELECT "genders".* FROM "genders"