app/controllers/candidates_controller.rb

SELECT "candidates".* FROM "candidates"
---
  def index
    @candidates = Candidate.all

INSERT INTO "candidates" ("birthdate", "cpf", "created_at", "gender", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["birthdate", "2014-08-21"], ["cpf", 212512122], ["created_at", "2014-08-21 20:31:44.845792"], ["gender", ""], ["name", "John Doe"], ["updated_at", "2014-08-21 20:31:44.845792"]]
---
  def create
    @candidate = Candidate.new(candidate_params)

    respond_to do |format|
      if @candidate.save

UPDATE "candidates" SET "birthdate" = ?, "updated_at" = ? WHERE "candidates"."id" = 2  [["birthdate", "2014-07-06"], ["updated_at", "2014-08-21 20:31:56.639840"]]
---
  def update
    respond_to do |format|
      if @candidate.update(candidate_params)

DELETE FROM "candidates" WHERE "candidates"."id" = ?  [["id", 1]]
---
  def destroy
    @candidate.destroy

SELECT  "candidates".* FROM "candidates"  WHERE "candidates"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_candidate
      @candidate = Candidate.find(params[:id])